import os
import sys

sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), 'compiler_demo')))

from compiler_demo import my_program


def main() -> None:
    prog1 = '''
        цел ввод_цел(лит имя)
        нач
            если имя != "" то нач
                вывод("Введите " + имя + ": ");
            кон
            вернуть в_цел(read());
        кон
        вещ input_вещ(лит имя)
        нач
            если имя != "" то нач
                вывод("Введите " + имя + ": ");
            кон
            вернуть в_вещ(read());
        кон

        цел g, g2 = g, g4 = 90;

        цел a = ввод_цел("a");
        вещ b = input_вещ("b"), c = input_вещ("c");  /* comment 1
        цел d = ввод_цел("d");
        */
        для (цел i = 0, j = 8; ((i <= 5)) && g; i = i + 1, вывод(5))
            для(; a < b;)
                если a > 7 + b то
                нач
                    c = a + b * (2 - 1) + 0;  // comment 2
                    лит bb = "98\tура";
                кон
                иначе
                    если a то
                        вывод((c + 1) + " " + 89.89);
        для(лог i = true;;);
        
        цел z;
        z= 0;
    '''
    prog2 = ''' цел f1(цел p1, вещ p2)
                нач
                    лит a = p1 + p2;
                    цел x;
                кон
                    '''
    prog3 = 'для (;;);'
    prog4 = 'цел i; i = 5;'
    prog5 = '''
        цел ввод_цел(лит имя) 
        нач
            если имя != "" то
            нач
                вывод("Введите " + имя + ": ");
            кон
            вернуть в_цел(read());

            //лог a() нач кон
        кон
        цел ввод_цел2(лит имя, цел a, цел имя2)
        нач
            если имя != "" то
            нач
                вывод("Введите " + имя + ": ");
            кон
            вернуть в_цел("");
        кон
    '''
    prog6 = """
        если 3>4 то
            вывод("Привет");
        иначе вывод("Пока");
    """
    prog7 = """
    цел а=0, б=5;
        пока а>б повторять нач кон;
    """
    prog8= """
    цел массив[10];
    массив[0] = 5;
    """
    prog9= """
    цел массив[5][10];
    массив[0][0] = 5;
    массив[1][9] = 10;
    """

    my_program.execute(prog1)


if __name__ == "__main__":
    main()
